constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       99400;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       99500;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          500;
        startFace       99600;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       100100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100000;
        startFace       100600;
    }
)

// ************************************************************************* //
